---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileFlipAlong
source: html/1444910d-3d51-3266-cdd4-0310bf763280.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileFlipAlong Property

True if the corresponding left/upper parts profile are mirrored with respect
 to the center line of the hosts to be divided. False if the profile of
 left/upper parts are defined directly by the profile family.

## Syntax (C#)
```csharp
public bool ProfileFlipAlong { get; set; }
```